///////////////////////////////////////////////////////////////////////////////////////
//  程式檔名：
//  IERA20404Dao.cs
//  程式名稱：
//  各部會處置報告最新填報狀況查詢頁面
///////////////////////////////////////////////////////////////////////////////////////
//  開發人員            日期             版本        備註
//  Joe             2019-07-19       1.0.0.0     初始版本
///////////////////////////////////////////////////////////////////////////////////////
//  Copyright (C) NEC Taiwan Ltd. 2018-2019.
//  程式描述：
//  各部會處置報告最新填報狀況查詢頁面
///////////////////////////////////////////////////////////////////////////////////////
using EMIC2.Models.Dao.Dto.ERA.ERA20404;
using System.Collections.Generic;

namespace EMIC2.Models.Interface.ERA2.ERA20404
{
    public interface IERA20404Dao
    {
        /// <summary>
        /// 各部會處置報告最新填報狀況查詢頁面
        /// </summary>
        /// <returns> IEnumerable<ERA20401Dto></returns>
        IEnumerable<ERA20404Dto> ERA2_0404_M(ERA20404Dto data);
    }
}
