///////////////////////////////////////////////////////////////////////////////////////
//  程式檔名：
//  IERA20405Dao.cs
//  程式名稱：
//  道路通阻案件
///////////////////////////////////////////////////////////////////////////////////////
//  開發人員            日期             版本        備註
//  Joe             2019-07-23       1.0.0.0     初始版本
///////////////////////////////////////////////////////////////////////////////////////
//  Copyright (C) NEC Taiwan Ltd. 2018-2019.
//  程式描述：
//  道路通阻案件
///////////////////////////////////////////////////////////////////////////////////////
using EMIC2.Models.Dao.Dto;
using EMIC2.Models.Dao.Dto.ERA.ERA20405;
using System.Collections.Generic;

namespace EMIC2.Models.Interface.ERA2
{
    public interface IERA20405Dao
    {
        /// <summary>
        /// 專案查詢 道路通阻案件查詢
        /// </summary>
        /// <returns>List<ERA2Dto></returns>
        List<ERA20405> ERA2_0405_M(ERA2Dto data);
    }
}
